app/views/planes/index.html.erb

SELECT "appointments".* FROM "appointments" WHERE "appointments"."plane_id" = $1  [["plane_id", 4]]
---

        <% if plane.appointments.length != 0 %>