app/views/pilots/index.html.erb

SELECT "appointments".* FROM "appointments" WHERE "appointments"."pilot_id" = $1  [["pilot_id", 2]]
---

        <% if pilot.appointments.length != 0 %>