app/controllers/appointments_controller.rb

SELECT  "appointments".* FROM "appointments" ORDER BY "appointments"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def index
    @appointments = Appointment.all

INSERT INTO "appointments" ("created_at", "updated_at", "pilot_id", "plane_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2018-09-20 14:27:16.251739"], ["updated_at", "2018-09-20 14:27:16.251739"], ["pilot_id", 5], ["plane_id", 2]]
---
  def create
    @appointment = Appointment.new(appointment_params)

    respond_to do |format|
      if @appointment.save

UPDATE "appointments" SET "pilot_id" = $1, "updated_at" = $2 WHERE "appointments"."id" = $3  [["pilot_id", 4], ["updated_at", "2018-09-20 14:24:47.084119"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @appointment.update(appointment_params)