app/controllers/pilots_controller.rb

SELECT "pilots".* FROM "pilots"
---
  def index
    @pilots = Pilot.all

INSERT INTO "pilots" ("name", "pic", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", ""], ["pic", ""], ["created_at", "2018-09-20 15:07:23.378246"], ["updated_at", "2018-09-20 15:07:23.378246"]]
---
  def create
    @pilot = Pilot.new(pilot_params)

    respond_to do |format|
      if @pilot.save

UPDATE "pilots" SET "pic" = $1, "updated_at" = $2 WHERE "pilots"."id" = $3  [["pic", "https://ibb.co/ejsKXK\"><img src=\"https://preview.ibb.co/gfcmCK/marge.jpg"], ["updated_at", "2018-09-20 21:31:50.974200"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @pilot.update(pilot_params)

DELETE FROM "pilots" WHERE "pilots"."id" = $1  [["id", 3]]
---
  def destroy
    @pilot.destroy

SELECT  "pilots".* FROM "pilots" WHERE "pilots"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_pilot
      @pilot = Pilot.find(params[:id])