app/controllers/planes_controller.rb

  def create
    @plane = Plane.new(plane_params)

    respond_to do |format|
      if @plane.save
---
INSERT INTO "planes" ("model", "manufacturer", "range", "age", "created_at", "updated_at", "registration") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["model", "PA28"], ["manufacturer", "PIPER"], ["range", 2000], ["age", 2], ["created_at", "2018-09-20 14:27:00.756325"], ["updated_at", "2018-09-20 14:27:00.756325"], ["registration", "G-EZHT"]]

  def update
    respond_to do |format|
      if @plane.update(plane_params)
---
UPDATE "planes" SET "registration" = $1, "updated_at" = $2 WHERE "planes"."id" = $3  [["registration", ""], ["updated_at", "2018-09-20 13:55:49.015019"], ["id", 1]]

  def destroy
    @plane.destroy
---
DELETE FROM "planes" WHERE "planes"."id" = $1  [["id", 1]]

    def set_plane
      @plane = Plane.find(params[:id])
---
SELECT  "planes".* FROM "planes" WHERE "planes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]