app/views/appointments/_form.html.erb

    <%= form.label :plane_id %>
    <%= form.collection_select(:plane_id, Plane.all, :id, :model) %>
---
SELECT "planes".* FROM "planes"

    <%= form.label :pilot_id %>
    <%= form.collection_select(:pilot_id, Pilot.all, :id, :name) %>
---
SELECT "pilots".* FROM "pilots"