app/views/appointments/index.html.erb

<p id="notice"><%= notice %></p>
<% if Appointment.first.nil? %>
---
SELECT  "appointments".* FROM "appointments" ORDER BY "appointments"."id" ASC LIMIT $1  [["LIMIT", 1]]